{
  "recipes": [
    {
      "name": "Adobo",
      "category": "Main Dish",
      "description": "A popular Filipino dish consisting of meat (commonly chicken, pork, or a combination) marinated in vinegar, soy sauce, garlic, bay leaves, and black peppercorns then simmered until tender.",
      "image_url": "https://example.com/adobo_image.jpg",
      "ingredients": [
        "1 kg chicken or pork, cut into serving pieces",
        "1/2 cup soy sauce",
        "1/2 cup vinegar",
        "1 head garlic, minced",
        "3 bay leaves",
        "1 teaspoon whole peppercorns",
        "1 cup water",
        "2 tablespoons cooking oil"
      ],
      "instructions": [
        "In a bowl, combine soy sauce, vinegar, garlic, bay leaves, and peppercorns. Marinate the meat in this mixture for at least 30 minutes.",
        "Heat oil in a pan. Sauté the marinated meat until brown.",
        "Pour in the marinade and water. Bring to a boil, then lower the heat and simmer until the meat is tender and the sauce is reduced and thickened.",
        "Serve hot with rice."
      ]
    },
    {
      "name": "Sinigang",
      "category": "Soup",
      "description": "A sour soup or stew characterized by its distinct sour flavor, typically made with pork, beef, or seafood, along with vegetables like kangkong (water spinach), radish, eggplant, and tomatoes.",
      "image_url": "https://example.com/sinigang_image.jpg",
      "ingredients": [
        "500g pork ribs or pork belly, cut into chunks",
        "1 medium onion, quartered",
        "2 medium tomatoes, quartered",
        "2 cups kangkong (water spinach), chopped",
        "1 large daikon radish, peeled and sliced",
        "1 medium eggplant, sliced",
        "3-4 pieces green chili peppers",
        "1 packet sinigang mix",
        "8 cups water",
        "Fish sauce or salt, to taste"
      ],
      "instructions": [
        "In a pot, bring water to a boil. Add the pork ribs and simmer until tender.",
        "Add onions and tomatoes, and simmer until softened.",
        "Add the radish and eggplant, then the sinigang mix. Simmer until vegetables are cooked.",
        "Add kangkong and chili peppers. Season with fish sauce or salt to taste.",
        "Serve hot with rice."
      ]
    },
    {
      "name": "Kare-Kare",
      "category": "Main Dish",
      "description": "A rich and savory Filipino stew made with oxtail, tripe, and vegetables cooked in a thick peanut sauce, served with bagoong (shrimp paste) on the side.",
      "image_url": "https://example.com/kare_kare_image.jpg",
      "ingredients": [
        "1 kg oxtail or beef tripe, cut into pieces",
        "1/2 cup peanut butter",
        "1/4 cup ground toasted rice",
        "2 medium eggplants, sliced",
        "1 bundle bok choy (pechay)",
        "1 bundle string beans, cut into 2-inch lengths",
        "1/2 cup annatto seeds (achuete)",
        "1 onion, chopped",
        "4 cloves garlic, minced",
        "Fish sauce or salt, to taste"
      ],
      "instructions": [
        "Boil the oxtail or tripe until tender. Set aside the broth.",
        "In a separate pan, sauté garlic and onions until fragrant. Add the peanut butter and ground toasted rice, then stir in the oxtail or tripe and annatto water (water from soaking annatto seeds).",
        "Pour in the reserved broth and simmer until the meat is fully cooked and the sauce has thickened.",
        "Add the vegetables and cook until tender.",
        "Season with fish sauce or salt to taste.",
        "Serve hot with bagoong on the side."
      ]
    },
    {
      "name": "Lechon",
      "category": "Main Dish",
      "description": "A whole roasted pig dish, popular during celebrations and special occasions, known for its crispy skin and tender meat seasoned with spices and herbs.",
      "image_url": "https://example.com/lechon_image.jpg",
      "ingredients": [
        "1 whole pig (around 20-30 kg)",
        "Salt",
        "Pepper",
        "Garlic, minced",
        "Lemongrass, chopped"
      ],
      "instructions": [
        "Clean the pig thoroughly and pat it dry.",
        "Rub salt, pepper, minced garlic, and chopped lemongrass all over the pig, including inside the cavity.",
        "Roast the pig on a spit over charcoal or in a large oven until the skin is crispy and golden brown, and the meat is tender.",
        "Serve hot with a dipping sauce made from vinegar, soy sauce, and chili peppers."
      ]
    },
    {
      "name": "Pancit",
      "category": "Main Dish",
      "description": "A stir-fried noodle dish made with rice noodles, meat (such as chicken, pork, or shrimp), and vegetables, seasoned with soy sauce and often garnished with calamansi and chopped green onions.",
      "image_url": "https://example.com/pancit_image.jpg",
      "ingredients": [
        "500g rice noodles (bihon or canton)",
        "250g chicken breast, sliced thinly",
        "250g pork belly, sliced thinly",
        "1 cup shrimp, peeled and deveined",
        "2 cups mixed vegetables (carrots, cabbage, snow peas)",
        "4 cloves garlic, minced",
        "1 onion, sliced",
        "3 tablespoons soy sauce",
        "Fish sauce, to taste",
        "Calamansi or lemon wedges, for serving",
        "Chopped green onions, for garnish"
      ],
      "instructions": [
        "Soak the rice noodles in water until soft, then drain.",
        "In a wok or large skillet, heat oil and sauté garlic and onions until fragrant.",
        "Add chicken and pork, cook until browned.",
        "Add shrimp and mixed vegetables, cook until shrimp turn pink and vegetables are tender.",
        "Add the drained noodles and soy sauce, toss to combine.",
        "Season with fish sauce to taste.",
        "Serve hot with calamansi wedges and chopped green onions."
      ]
    }
  ]
}
