{
    "key": "",
    "recipes": [
      {
        "name": "Adobo",
        "description": "A popular Filipino dish consisting of meat (commonly chicken, pork, or a combination) marinated in vinegar, soy sauce, garlic, bay leaves, and black peppercorns then simmered until tender."
      },
      {
        "name": "Sinigang",
        "description": "A sour soup or stew characterized by its distinct sour flavor, typically made with pork, beef, or seafood, along with vegetables like kangkong (water spinach), radish, eggplant, and tomatoes."
      },
      {
        "name": "Kare-Kare",
        "description": "A rich and savory Filipino stew made with oxtail, tripe, and vegetables cooked in a thick peanut sauce, served with bagoong (shrimp paste) on the side."
      },
      {
        "name": "Lechon",
        "description": "A whole roasted pig dish, popular during celebrations and special occasions, known for its crispy skin and tender meat seasoned with spices and herbs."
      },
      {
        "name": "Pancit",
        "description": "A stir-fried noodle dish made with rice noodles, meat (such as chicken, pork, or shrimp), and vegetables, seasoned with soy sauce and often garnished with calamansi and chopped green onions."
      },
      {
        "name": "Bulalo",
        "description": "A hearty beef soup made with bone marrow, beef shanks, and vegetables like corn, cabbage, and bok choy, flavored with fish sauce and peppercorns."
      },
      {
        "name": "Tinola",
        "description": "A clear chicken soup flavored with ginger, garlic, and fish sauce, with green papaya or sayote (chayote) and chili leaves added for flavor and nutrition."
      },
      {
        "name": "Paksiw",
        "description": "A cooking method where meat (commonly fish or pork) is simmered in a vinegar-based sauce with garlic, ginger, and spices, resulting in a tangy and savory dish."
      },
      {
        "name": "Sisig",
        "description": "A flavorful dish made from chopped pig's head and liver, seasoned with calamansi juice, soy sauce, and chili peppers, often served on a sizzling plate."
      },
      {
        "name": "Tinapang Bangus",
        "description": "Milkfish (bangus) that has been marinated, smoked, and dried, resulting in a flavorful and aromatic fish commonly eaten with rice and vinegar."
      },
      {
        "name": "Dinuguan",
        "description": "A savory pork blood stew made with pork meat, innards, and/or skin cooked in a rich, thick gravy flavored with vinegar, garlic, and chili peppers."
      },
      {
        "name": "Pinakbet",
        "description": "A vegetable dish made with mixed vegetables like eggplant, bitter melon, squash, and okra, sautéed with shrimp paste and sometimes pork or seafood."
      },
      {
        "name": "Champorado",
        "description": "A sweet chocolate rice porridge made by boiling glutinous rice with cocoa powder or tablea (local chocolate tablets), often served with evaporated milk and dried fish."
      },
      {
        "name": "Humba",
        "description": "A sweet and savory pork dish similar to adobo, but with the addition of pineapple juice, resulting in a tender and flavorful stew."
      },
      {
        "name": "Lumpia",
        "description": "Filipino spring rolls filled with a mixture of minced meat (usually pork or chicken), vegetables, and sometimes shrimp, then fried until crispy."
      },
      {
        "name": "Laing",
        "description": "A spicy Filipino dish made from dried taro leaves and coconut milk, often cooked with shrimp paste, pork, and chili peppers."
      },
      {
        "name": "Puto",
        "description": "A type of Filipino steamed rice cake made from rice flour, sugar, and coconut milk, often served as a snack or dessert."
      },
      {
        "name": "Taho",
        "description": "A sweet and comforting snack made from soft tofu, arnibal (sweet syrup made from brown sugar and vanilla), and sago pearls."
      },
      {
        "name": "Balut",
        "description": "A fertilized duck egg with a partially developed embryo inside, boiled and typically eaten with a sprinkle of salt or a dip in vinegar."
      },
      {
        "name": "Longganisa",
        "description": "A sweet and savory Filipino sausage made from ground pork seasoned with garlic, sugar, and spices, often served for breakfast with garlic rice and eggs."
      },
      {
        "name": "Pancit Malabon",
        "description": "A seafood noodle dish from the city of Malabon, characterized by its thick rice noodles, topped with a shrimp, squid, and smoked fish sauce."
      },
      {
        "name": "Inihaw na Pusit",
        "description": "Grilled squid marinated in a mixture of vinegar, soy sauce, calamansi juice, and garlic, resulting in a smoky and flavorful seafood dish."
      },
      {
        "name": "Turon",
        "description": "A Filipino dessert made from ripe bananas rolled in brown sugar, wrapped in spring roll wrappers, and fried until crispy, often served with a drizzle of caramel sauce."
      },
      {
        "name": "Ginataang Langka",
        "description": "A Filipino dish made from unripe jackfruit cooked in coconut milk, often with shrimp, pork, or fish, seasoned with garlic, ginger, and chili peppers."
      }
    ]
  }
  